# tap
tap "olets/tap"
tap "supabase/tap"
tap "satococoa/tap"
tap "songmu/tap"

# install AppStore applications via mas
brew "mas"

# replace basic commands with GNU/Linux version
brew "bash"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "wget"
brew "iproute2mac"

# utility commands
brew "git"
brew "neovim"
brew "tree"
brew "tmux"
brew "jq"
brew "yq"
brew "unzip"
brew "fzf"
brew "ghq"
brew "gh"
brew "mise"
brew "direnv"
brew "bat"
brew "git-delta"
brew "qemu"
brew "colima", start_service: true
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "kubectx"
brew "kubie"
brew "stern"
brew "navi"
brew "git-secrets"
brew "act"
brew "supabase/tap/supabase"
brew "ripgrep"
brew "patchutils"
brew "codex"
brew "gemini-cli"
brew "kind"
brew "watchman"
brew "ffmpeg"
brew "imagemagick"
brew "biome"
brew "tursodatabase/tap/turso"
brew "deck"
brew "qrencode"
brew "songmu/tap/laminate"


# zsh customize
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "olets/tap/zsh-abbr"
brew "starship"
brew "sheldon"
brew "terminal-notifier"

# fonts
cask "font-udev-gothic"
cask "font-udev-gothic-nf"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-biz-udgothic"

# GUI applications
cask "karabiner-elements"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "azookey"
cask "raycast"
cask "logi-options+"
cask "appcleaner"
cask "1password-cli"
cask "session-manager-plugin"
# cask "docker-desktop"
cask "git-credential-manager"
cask "cleanshot"
cask "arc"
cask "obsidian"
cask "amazon-q"
cask "notion"
cask "chatgpt"
cask "claude"
cask "1password"
cask "discord"
cask "slack"
cask "ghostty"
cask "lm-studio"
cask "alt-tab"
cask "expo-orbit"
cask "zulu@17"
cask "android-studio"
cask "figma"
cask "microsoft-teams"
cask "microsoft-powerpoint"
cask "microsoft-excel"
cask "microsoft-word"

# App Store applications
mas "Endel: Focus, Sleep, Relax", id:1346247457
mas "BetterSnapTool", id:417375580
mas "LINE", id:539883307
mas "Kindle", id:302584613
mas "one sec | screen time + focus", id:1532875441
