# tap
tap "homebrew/cask-fonts"
tap "olets/tap"

# replace basic commands with GNU/Linux version
brew "coreutils"
brew "diffutils"
brew "ed"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "wget"
brew "iproute2mac"

# utility commands
brew "git"
brew "neovim"
brew "tree"
brew "tmux"
brew "jq"
brew "yq"
brew "unzip"
brew "fzf"
brew "ghq"
brew "gh"
brew "mise"
brew "pipx"
brew "bat"
brew "git-delta"
brew "kubectx"
brew "lima"

# zsh customise
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "olets/tap/zsh-abbr"
brew "starship"

# fonts
cask "font-hack-nerd-font"

# GUI applications
cask "visual-studio-code"
cask "karabiner-elements"
cask "google-japanese-ime"
cask "appcleaner"
cask "1password-cli"
cask "raycast"
cask "wezterm"
cask "session-manager-plugin"
cask "wireshark"
cask "docker"
cask "git-credential-manager"
cask "cleanshot"
cask "notion-calendar"
cask "notion"
cask "arc"
