# tap
tap "homebrew/cask-fonts"
tap "olets/tap"
tap "supabase/tap"
tap "satococoa/tap"

# replace basic commands with GNU/Linux version
brew "bash"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "wget"
brew "iproute2mac"

# utility commands
brew "git"
brew "neovim"
brew "tree"
brew "tmux"
brew "jq"
brew "yq"
brew "unzip"
brew "fzf"
brew "ghq"
brew "gh"
brew "mise"
brew "direnv"
brew "bat"
brew "git-delta"
brew "kubectl"
brew "kubectx"
brew "kubie"
brew "stern"
brew "lima"
brew "navi"
brew "git-secrets"
brew "act"
brew "supabase/tap/supabase"
brew "ripgrep"
brew "patchutils"
# cspell:ignore satococoa
brew "satococoa/tap/wtp"
brew "codex"

# zsh customize
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "olets/tap/zsh-abbr"
brew "starship"
brew "sheldon"

# fonts
cask "font-hack-nerd-font"

# GUI applications
cask "visual-studio-code"
cask "karabiner-elements"
cask "google-japanese-ime"
cask "appcleaner"
cask "1password-cli"
cask "raycast"
cask "wezterm"
cask "session-manager-plugin"
cask "docker"
cask "git-credential-manager"
cask "cleanshot"
cask "arc"
cask "obsidian"
cask "amazon-q"
cask "notion"
cask "claude"
cask "1password"
